jtimon/RepRapFirmware/src/targets/STM32/BoardConfig.cpp
/*
 * Board Config
 *
 *  Created on: 3 Feb 2019
 *      Author: sdavi
 */



#include <stdio.h>
#include <ctype.h>
#include <string.h>
#include <stdint.h>
#include "Version.h"
#include "BoardConfig.h"
#include "RepRapFirmware.h"
#include "sd_mmc.h"
#include "SPI.h"
#include "HardwareSPI.h"
#include "HardwareSDIO.h"
#include "Platform/Platform.h"

#include "HybridPWM.h"
#include "ff.h"
#include "SoftwareReset.h"
#include "ExceptionHandlers.h"

#include "pinmap.h"

#if STM32H7
# include "stm32h7xx_ll_system.h"
# include "core_cm7.h"
#else
# include "stm32f4xx_ll_system.h"
# include "core_cm4.h"
#endif

#if SUPPORT_TMC22xx || SUPPORT_DMA_NEOPIXEL
# include "DMABitIO.h"
#endif

extern char _sccmram;					// defined in linker script
extern char _eccmram;					// defined in linker script
static constexpr char boardConfigFile[] = "board.txt";

//Single entry for Board name
static const boardConfigEntry_t boardEntryConfig[]=
{
//    {"lpc.board", &lpcBoardName, nullptr, cvStringType},
    {"board", &lpcBoardName, nullptr, cvStringType},
};

//All other board configs
static const boardConfigEntry_t boardConfigs[]=
{
    {"leds.diagnostic", &DiagPin, nullptr, cvPinType},

    //Steppers
    {"stepper.powerEnablePin", &StepperPowerEnablePin, nullptr, cvPinType},
    {"stepper.enablePins", ENABLE_PINS, &NumDirectDrivers, cvPinType},
    {"stepper.stepPins", STEP_PINS, &NumDirectDrivers, cvPinType},
    {"stepper.directionPins", DIRECTION_PINS, &NumDirectDrivers, cvPinType},
    {"stepper.digipotFactor", &digipotFactor, nullptr, cvFloatType},
#if HAS_SMART_DRIVERS
    {"stepper.TmcUartPins", TMC_PINS, &NumDirectDrivers, cvPinType},
    {"stepper.numSmartDrivers", &totalSmartDrivers, nullptr, cvUint32Type},
#if SUPPORT_TMC51xx
    {"stepper.num5160Drivers", &num5160SmartDrivers, nullptr, cvUint32Type},
    {"stepper.spiChannel", &SmartDriversSpiChannel, nullptr, cvUint8Type},
#endif
#if HAS_STALL_DETECT && SUPPORT_TMC22xx
    {"stepper.TmcDiagPins", DriverDiagPins, &NumDirectDrivers, cvPinType},
#endif
#endif
    //Heater sensors
    {"heat.tempSensePins", TEMP_SENSE_PINS, &NumThermistorInputs, cvPinType},
    {"heat.spiTempSensorCSPins", SpiTempSensorCsPins, &MaxSpiTempSensors, cvPinType},
    {"heat.spiTempSensorChannel", &TempSensorSSPChannel, nullptr, cvUint8Type},
    
    //ATX Power
    {"atx.powerPin", &ATX_POWER_PIN, nullptr, cvPinType},
    {"atx.powerPinInverted", &ATX_POWER_INVERTED, nullptr, cvBoolType},
    {"atx.initialPowerOn", &ATX_INITIAL_POWER_ON, nullptr, cvBoolType},

    //SDCards
    {"sdCard.internal.spiFrequencyHz", &InternalSDCardFrequency, nullptr, cvUint32Type},
    {"sdCard.external.csPin", &SdSpiCSPins[1], nullptr, cvPinType},
    {"sdCard.external.cardDetectPin", &SdCardDetectPins[1], nullptr, cvPinType},
    {"sdCard.external.spiFrequencyHz", &ExternalSDCardFrequency, nullptr, cvUint32Type},
    {"sdCard.external.spiChannel", &ExternalSDCardSSPChannel, nullptr, cvUint8Type},

#if SUPPORT_12864_LCD
    {"lcd.lcdCSPin", &LcdCSPin, nullptr, cvPinType},
    {"lcd.lcdBeepPin", &LcdBeepPin, nullptr, cvPinType},
    {"lcd.encoderPinA", &EncoderPinA, nullptr, cvPinType},
    {"lcd.encoderPinB", &EncoderPinB, nullptr, cvPinType},
    {"lcd.encoderPinSw", &EncoderPinSw, nullptr, cvPinType},
    {"lcd.lcdDCPin", &LcdA0Pin, nullptr, cvPinType},
    {"lcd.panelButtonPin", &PanelButtonPin, nullptr, cvPinType},
    {"lcd.spiChannel", &LcdSpiChannel, nullptr, cvUint8Type},
#endif
    
//    {"softwareSPI.pins", SPIPins[3], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI0.pins", SPIPins[0], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI1.pins", SPIPins[1], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI2.pins", SPIPins[2], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI3.pins", SPIPins[3], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI4.pins", SPIPins[4], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI5.pins", SPIPins[5], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#if STM32H7
    {"SPI6.pins", SPIPins[6], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI7.pins", SPIPins[7], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI8.pins", SPIPins[8], &NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#endif
    
#if HAS_WIFI_NETWORKING
    {"8266wifi.espDataReadyPin", &EspDataReadyPin, nullptr, cvPinType},
    {"8266wifi.lpcTfrReadyPin", &SamTfrReadyPin, nullptr, cvPinType},
    {"8266wifi.TfrReadyPin", &SamTfrReadyPin, nullptr, cvPinType},
    {"8266wifi.espResetPin", &EspResetPin, nullptr, cvPinType},
    {"8266wifi.csPin", &SamCsPin, nullptr, cvPinType},
    {"8266wifi.serialRxTxPins", &WifiSerialRxTxPins, &NumberSerialPins, cvPinType},
    {"8266wifi.spiChannel", &WiFiSpiChannel, nullptr, cvUint8Type},    
#endif

#if HAS_SBC_INTERFACE
//    {"sbc.lpcTfrReadyPin", &SbcTfrReadyPin, nullptr, cvPinType},
    {"sbc.TfrReadyPin", &SbcTfrReadyPin, nullptr, cvPinType},
    {"sbc.csPin", &SbcCsPin, nullptr, cvPinType},
    {"sbc.spiChannel", &SbcSpiChannel, nullptr, cvUint8Type},    
    {"sbc.loadConfig", &SbcLoadConfig, nullptr, cvBoolType},    
#endif

#if defined(SERIAL_AUX_DEVICE)
    {"serial.aux.rxTxPins", &AuxSerialRxTxPins, &NumberSerialPins, cvPinType},
#endif
#if defined(SERIAL_AUX2_DEVICE)
    {"serial.aux2.rxTxPins", &Aux2SerialRxTxPins, &NumberSerialPins, cvPinType},
#endif
    
//    {"adc.prefilter.enable", &ADCEnablePreFilter, nullptr, cvBoolType},

#if SUPPORT_LED_STRIPS
    {"led.neopixelPin", &NeopixelOutPin, nullptr, cvPinType},
#endif

#if HAS_VOLTAGE_MONITOR
    {"power.VInDetectPin", &PowerMonitorVinDetectPin, nullptr, cvPinType},
    {"power.voltage", &VInDummyReading, nullptr, cvUint32Type},
#endif
#if SUPPORT_ACCELEROMETERS
    {"accelerometer.spiChannel", &AccelerometerSpiChannel, nullptr, cvUint8Type},
#endif

};

uint32_t crc32_for_byte(uint32_t r) 
{
    for(int j = 0; j < 8; ++j)
        r = (r & 1? 0: (uint32_t)0xEDB88320L) ^ r >> 1;
    return r ^ (uint32_t)0xFF000000L;
}

uint32_t crc32(const void *data, size_t n_bytes) 
{
    uint32_t table[0x100];
    uint32_t crc = 0;

