jtimon/RepRapFirmware/src/targets/STM32/BoardConfig.cpp
    for(size_t i = 0; i < 0x100; ++i)
        table[i] = crc32_for_byte(i);
    for(size_t i = 0; i < n_bytes; ++i)
        crc = table[(uint8_t)crc ^ ((uint8_t*)data)[i]] ^ crc >> 8;
    return crc;
}


#if HAS_SBC_INTERFACE
class InMemoryBoardConfiguration
{
public:
    InMemoryBoardConfiguration() : signature(invalidSignature), length(0) {}
    bool isValid() noexcept;
    void setConfiguration() noexcept;
    void getConfiguration() noexcept;
    void saveToBackupRAM() noexcept;
    void loadFromBackupRAM() noexcept;
    bool isEqual(InMemoryBoardConfiguration& other) noexcept;
private:
    static constexpr uint32_t validSignature = 0xBCBC0002;
    static constexpr uint32_t invalidSignature = 0xBAD0BAD1;
    static constexpr int maxData = 512;
    uint32_t signature;
    uint32_t configEntrySig;
    uint32_t length;
    uint8_t data[maxData];
};

bool InMemoryBoardConfiguration::isValid() noexcept
{
    //debugPrintf("Memory at %x signature %x confSig %x\n", (unsigned)this, (unsigned) signature, (unsigned)configEntrySig);
    return signature == validSignature && configEntrySig == crc32(boardConfigs, sizeof(boardConfigs));
}

void InMemoryBoardConfiguration::setConfiguration() noexcept
{
    if (!isValid()) debugPrintf("Warning: Setting configuration from invalid memory\n");
    uint8_t *pmem = data;
    memcpy(lpcBoardName, pmem, MaxBoardNameLength);
    SetBoard(lpcBoardName);
    pmem += MaxBoardNameLength;
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        const boardConfigEntry_t item = boardConfigs[i];
        uint32_t len = (item.maxArrayEntries == nullptr ? CVTLengths[item.type] : *item.maxArrayEntries*CVTLengths[item.type]);
        memcpy(item.variable, pmem, len);
        pmem += len;
    }
}

void InMemoryBoardConfiguration::getConfiguration() noexcept
{
    uint8_t *pmem = data;
    memcpy(pmem, lpcBoardName, MaxBoardNameLength);
    pmem += MaxBoardNameLength;
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        const boardConfigEntry_t item = boardConfigs[i];
        uint32_t len = (item.maxArrayEntries == nullptr ? CVTLengths[item.type] : *item.maxArrayEntries*CVTLengths[item.type]);
        memcpy(pmem, item.variable, len);
        pmem += len;
        if (pmem - data > maxData)
        {
            debugPrintf("Warning configuration data too large\n");
            return;
        }
    }
    length = pmem - data;
    signature = validSignature;
    configEntrySig = crc32(boardConfigs, sizeof(boardConfigs));
    //debugPrintf("config length %d sig %x\n", (int)length, (unsigned)configEntrySig);
}

void InMemoryBoardConfiguration::saveToBackupRAM() noexcept
{
    // enable access to backup RAM
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    __HAL_RCC_BKPSRAM_CLK_ENABLE();
    memcpy((void *)BKPSRAM_BASE, this, sizeof(InMemoryBoardConfiguration));
}

void InMemoryBoardConfiguration::loadFromBackupRAM() noexcept
{
    // enable access to backup RAM
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    __HAL_RCC_BKPSRAM_CLK_ENABLE();
    memcpy(this, (void *)BKPSRAM_BASE, sizeof(InMemoryBoardConfiguration));
    //if (isValid())
        //debugPrintf("Loaded valid configuration data from backup RAM\n");
}


bool InMemoryBoardConfiguration::isEqual(InMemoryBoardConfiguration& other) noexcept
{
    return (isValid() && other.isValid() && length == other.length && !memcmp(data, other.data, length));
}
#endif


static inline bool isSpaceOrTab(char c) noexcept
{
    return (c == ' ' || c == '\t');
}
    
BoardConfig::BoardConfig() noexcept
{
}

static void ConfigureGPIOPins() noexcept
{
    // loop through and set and pins that have special requirements from the board settings
    for (size_t lp = 0; lp < NumNamedLPCPins; ++lp)
    {
        switch (PinTable[lp].names[0])
        {
            case '+':
                pinMode(PinTable[lp].pin, OUTPUT_HIGH);
                break;
            case '-':
                pinMode(PinTable[lp].pin, OUTPUT_LOW);
                break;
            case '^':
                pinMode(PinTable[lp].pin, INPUT_PULLUP);
                break;
            default:
                break;
        }
    }
    // Handle special cases
    //Init pins for LCD
    //make sure to init ButtonPin as input incase user presses button
    if(PanelButtonPin != NoPin) pinMode(PanelButtonPin, INPUT); //unused
    if(LcdA0Pin != NoPin) pinMode(LcdA0Pin, OUTPUT_HIGH); //unused
    if(LcdBeepPin != NoPin) pinMode(LcdBeepPin, OUTPUT_LOW);
    // Set the 12864 display CS pin low to prevent it from receiving garbage due to other SPI traffic
    if(LcdCSPin != NoPin) pinMode(LcdCSPin, OUTPUT_LOW);

    //Init Diagnostcs Pin
#if STARTUP_DELAY
    if ((CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) != 0)
    {
        // Debugger is active do not allow use of those pins for diag light
        if (DiagPin == SWDIO_PIN || DiagPin == SWCLK_PIN)
            DiagPin = NoPin;
    } 
#endif

    pinMode(DiagPin, OUTPUT_LOW);

    // Configure ATX power control
    ATX_POWER_STATE = ATX_INITIAL_POWER_ON;
    if (StepperPowerEnablePin != NoPin)
        pinMode(StepperPowerEnablePin, (ATX_POWER_STATE ? OUTPUT_HIGH : OUTPUT_LOW));
}

static void ConfigureSPIPins(SSPChannel dev, Pin clk, Pin miso, Pin mosi)
{
    SPI::getSSPDevice(dev)->initPins(clk, miso, mosi, NoPin, NvicPrioritySpi);
}

static void FatalError(const char* fmt, ...)
{
    for(;;)
    {
        va_list vargs;
        va_start(vargs, fmt);
        reprap.GetPlatform().DebugMessage(fmt, vargs);
        va_end(vargs);
        delay(2000);
    }
}

static void MessageF(MessageType mtype, const char* fmt, ...)
{
    va_list vargs;
    va_start(vargs, fmt);
    reprap.GetPlatform().MessageV(mtype, fmt, vargs);
    va_end(vargs);
}

static void FlushMessages()
{
    uint32_t start = millis();
    while(reprap.GetPlatform().FlushMessages() && (millis() - start < 5000))
        ;
}

