jtimon/RepRapFirmware/src/targets/STM32/BoardConfig.cpp
#if HAS_SBC_INTERFACE
    if (SbcCsPin == NoPin || SbcTfrReadyPin == NoPin || SbcSpiChannel == SSPNONE)
    {
        FatalError("No SBC configuration\n");
        return;
    }
#endif
    //Calculate STEP_DRIVER_MASK (used for parallel writes)
    STEP_DRIVER_MASK = 0;
    // Currently not implemented for STM32
    #if 0
    for(size_t i=0; i<NumDirectDrivers; i++)
    {
        //It is assumed all pins will be on Port 2
        const Pin stepPin = STEP_PINS[i];
        if( stepPin != NoPin && (stepPin >> 5) == 2) // divide by 32 to get port number
        {
            STEP_DRIVER_MASK |= (1 << (stepPin & 0x1f)); //this is a bitmask of all the stepper pins on Port2 used for Parallel Writes
        }
        else
        {
            if(stepPin != NoPin)
            {
                // configured step pins are not on the same port - not using parallel writes
                hasStepPinsOnDifferentPorts = true;
            }
        }
    }
    #endif
    hasStepPinsOnDifferentPorts = true;
    
    //Does board have built in current control via digipots?
    if(digipotFactor > 1)
    {
        hasDriverCurrentControl = true;
    }
#if 0
    // anti-rotation detection feature disabled for now due to potential to damage some drivers
    CheckDriverPins();
#endif       
    //Setup the SPI Pins, note that the SD SPI device may already have been configured
    for(size_t i = 0; i < ARRAY_SIZE(SPIPins); i++)
        if (sdChannel != (SSPChannel)i)
            ConfigureSPIPins((SSPChannel)i, SPIPins[i][0], SPIPins[i][1], SPIPins[i][2]);
#if HAS_MASS_STORAGE
    // Set internal SD card frequency (if supported)
    sd_mmc_reinit_slot(0, NoPin, InternalSDCardFrequency);
    if (ExternalSDCardSSPChannel != SSPNONE && SdSpiCSPins[1] != NoPin)
    {
        sd_mmc_setSSPChannel(1, ExternalSDCardSSPChannel, SdSpiCSPins[1]);
        sd_mmc_reinit_slot(1, NoPin, ExternalSDCardFrequency);
    }
    // Update RRF settings
    MassStorage::Init2();
#endif
#if HAS_SBC_INTERFACE
    if(SbcCsPin != NoPin) pinMode(SbcCsPin, INPUT_PULLUP);
#endif
#if HAS_WIFI_NETWORKING
    if(SamCsPin != NoPin) pinMode(SamCsPin, OUTPUT_LOW);
    if(EspResetPin != NoPin) pinMode(EspResetPin, OUTPUT_LOW);
    APIN_ESP_SPI_MOSI = SPIPins[WiFiSpiChannel][2];
    APIN_ESP_SPI_MISO = SPIPins[WiFiSpiChannel][1];
    APIN_ESP_SPI_SCK = SPIPins[WiFiSpiChannel][0];
    
    if(WifiSerialRxTxPins[0] != NoPin && WifiSerialRxTxPins[1] != NoPin)
    {
        //Setup the Serial Port for ESP Wifi
        APIN_Serial1_RXD = WifiSerialRxTxPins[0];
        APIN_Serial1_TXD = WifiSerialRxTxPins[1];
        
        if(!SERIAL_WIFI_DEVICE.Configure(WifiSerialRxTxPins[0], WifiSerialRxTxPins[1]))
        {
            reprap.GetPlatform().MessageF(UsbMessage, "Failed to set WIFI Serial with pins %c.%d and %c.%d.\n", 'A'+(WifiSerialRxTxPins[0] >> 4), (WifiSerialRxTxPins[0] & 0xF), 'A'+(WifiSerialRxTxPins[1] >> 4), (WifiSerialRxTxPins[1] & 0xF) );
        }
    }
#endif

#if defined(SERIAL_AUX_DEVICE)
    //Configure Aux Serial
    if(AuxSerialRxTxPins[0] != NoPin && AuxSerialRxTxPins[1] != NoPin)
    {
        if(!SERIAL_AUX_DEVICE.Configure(AuxSerialRxTxPins[0], AuxSerialRxTxPins[1]))
        {
            reprap.GetPlatform().MessageF(UsbMessage, "Failed to set AUX Serial with pins %c.%d and %c.%d.\n", 'A'+(AuxSerialRxTxPins[0] >> 4), (AuxSerialRxTxPins[0] & 0xF), 'A'+(AuxSerialRxTxPins[1] >> 4), (AuxSerialRxTxPins[1] & 0xF) );
        }

    }
#endif

#if defined(SERIAL_AUX2_DEVICE)
    //Configure Aux2 Serial
    if(Aux2SerialRxTxPins[0] != NoPin && Aux2SerialRxTxPins[1] != NoPin)
    {
        if(!SERIAL_AUX2_DEVICE.Configure(Aux2SerialRxTxPins[0], Aux2SerialRxTxPins[1]))
        {
            reprap.GetPlatform().MessageF(UsbMessage, "Failed to set AUX2 Serial with pins %d.%d and %d.%d.\n", (Aux2SerialRxTxPins[0] >> 5), (Aux2SerialRxTxPins[0] & 0x1F), (Aux2SerialRxTxPins[1] >> 5), (Aux2SerialRxTxPins[1] & 0x1F) );
        }

    }
#endif

    ConfigureGPIOPins();

#if SUPPORT_TMC22xx || SUPPORT_DMA_NEOPIXEL
    DMABitIOInit();
#endif
}


//Convert a pin string into a RRF Pin
//Handle formats such as A.13, A_13, PA_13 or PA.13
Pin BoardConfig::StringToPin(const char *strvalue) noexcept
{
    if(strvalue == nullptr) return NoPin;
    
    if(tolower(*strvalue) == 'p') strvalue++; //skip P
    //check size.. should be 2, 3 or 4 chars i.e. A1 A.1, A.16, A_16.
    uint8_t len = strlen(strvalue);
    if(len >= 2 && len <= 4)
    {
        const char *ptr = nullptr;
        const char ch = toupper(*strvalue);
        uint8_t port = ch - 'A';
        if(port <= 8)
        {
            // skip "." or "_"
            if ((*(strvalue+1) == '.' || *(strvalue+1) == '_'))
                strvalue += 2;
            else
                strvalue += 1;
            uint8_t pin = StrToI32(strvalue, &ptr);          
            if(ptr > strvalue && pin < 16)
            {
                //Convert the Port and Pin to match the arrays in CoreSTM
                Pin lpcpin = (Pin) ( (port << 4) | pin);
                return lpcpin;
            }
        }
    }
    
    return NoPin;
}

Pin BoardConfig::LookupPin(char *strvalue) noexcept
{
    //Lookup a pin by name
    LogicalPin lp;
    bool hwInverted;
    
    //convert string to lower case for LookupPinName
    for(char *l = strvalue; *l; l++) *l = tolower(*l);
    
    if(LookupPinName(strvalue, lp, hwInverted))
    {
        return (Pin)lp; //lookup succeeded, return the Pin
    }
                     
    //pin may not be in the pintable so check if the format is a correct pin (returns NoPin if not)
    return StringToPin(strvalue);
}



void BoardConfig::PrintValue(MessageType mtype, configValueType configType, void *variable) noexcept
{
    switch(configType)
    {
        case cvPinType:
            {
                Pin pin = *(Pin *)(variable);
                if(pin == NoPin)
                {
                    MessageF(mtype, "NoPin");
                }
                else
                {
                    MessageF(mtype, "%c.%d", 'A' + (pin >> 4), (pin & 0xF) );
                }
            }
            break;
        case cvBoolType:
            MessageF(mtype, "%s", (*(bool *)(variable) == true)?"true":"false" );
            break;
        case cvFloatType:
            MessageF(mtype, "%.2f",  (double) *(float *)(variable) );
            break;
        case cvUint8Type:
            MessageF(mtype, "%u",  *(uint8_t *)(variable) );
            break;
        case cvUint16Type:
            MessageF(mtype, "%d",  *(uint16_t *)(variable) );
            break;
        case cvUint32Type:
            MessageF(mtype, "%lu",  *(uint32_t *)(variable) );
            break;
        case cvStringType:
            MessageF(mtype, "%s",  (char *)(variable) );
            break;
        default:{
            
