jtimon/RepRapFirmware/src/targets/STM32/BoardConfig.cpp
                *(uint8_t *)(variable) = val;
            }
            break;
        case cvUint16Type:
            {
                const char *ptr = nullptr;
                uint16_t val = StrToU32(valuePtr, &ptr);
                if(val < 0) val = 0;
                if(val > 0xFFFF) val = 0xFFFF;
                
                *(uint16_t *)(variable) = val;
                    
            }
            break;
        case cvUint32Type:
            {
                const char *ptr = nullptr;
                *(uint32_t *)(variable) = StrToU32(valuePtr, &ptr);
            }
            break;
            
        case cvStringType:
            {
                
                //TODO:: string Type only handles Board Name variable
                if(strlen(valuePtr)+1 < MaxBoardNameLength)
                {
                    strcpy((char *)(variable), valuePtr);
                }
            }
            break;
            
        default:
            debugPrintf("Unhandled ValueType\n");
    }
}

bool BoardConfig::LoadBoardConfigFromFile() noexcept
{
    FileStore * const configFile = reprap.GetPlatform().OpenSysFile(boardConfigFile, OpenMode::read);        //Open File
    if (configFile == nullptr)
    {
        MessageF(UsbMessage, "Configuration file %s not found\n", boardConfigFile );
        FlushMessages();
        return false;
    }
    MessageF(UsbMessage, "Loading config from %s...\n", boardConfigFile );

    //First find the board entry to load the correct PinTable for looking up Pin by name
    BoardConfig::GetConfigKeys(configFile, boardEntryConfig, (size_t) ARRAY_SIZE(boardEntryConfig));
    if(!SetBoard(lpcBoardName)) // load the Correct PinTable for the defined Board (RRF3)
    {
        //Failed to find string in known boards array
        debugPrintf("Warning: Failed to find board name '%s' using generic\n", lpcBoardName);
        SafeStrncpy(lpcBoardName, "generic", sizeof(lpcBoardName)); //replace the string in lpcBoardName to "unknown"
    }

    //Load all other config settings now that PinTable is loaded.
    configFile->Seek(0); //go back to beginning of config file
    BoardConfig::GetConfigKeys(configFile, boardConfigs, (size_t) ARRAY_SIZE(boardConfigs));
    configFile->Close();
    FlushMessages();
    return true;
}

#if HAS_SBC_INTERFACE
bool BoardConfig::LoadBoardConfigFromSBC() noexcept
{
    // Is this feature disabled?
    if (!SbcLoadConfig) return false;
    InMemoryBoardConfiguration oldConfig, newConfig;
    oldConfig.getConfiguration();
    //debugPrintf("Num smart drivers %d\n", totalSmartDrivers);
    BoardConfig::LoadBoardConfigFromFile();
    //debugPrintf("Num smart drivers after %d\n", totalSmartDrivers);
    newConfig.getConfiguration();
    if (oldConfig.isEqual(newConfig))
        MessageF(UsbMessage, "Configurations match\n");
    else
    {
        // store new config into memory that will survive a reboot
        newConfig.saveToBackupRAM();
        MessageF(UsbMessage, "Configurations do not match rebooting to load new settings\n");
        FlushMessages();
        delay(1000);
        SoftwareReset(SoftwareResetReason::erase); // Reboot
    }
    return true;
}

void BoardConfig::InvalidateBoardConfiguration() noexcept
{
    InMemoryBoardConfiguration emptyConfig;
    emptyConfig.saveToBackupRAM();
}
#endif

bool BoardConfig::GetConfigKeys(FileStore * const configFile, const boardConfigEntry_t *boardConfigEntryArray, const size_t numConfigs) noexcept
{
    constexpr size_t maxLineLength = 120;
    char line[maxLineLength];

    int readLen = configFile->ReadLine(line, maxLineLength);
    while(readLen >= 0)
    {
        //debugPrintf("ReadLine returns %d %s\n", readLen, line);
        size_t len = (size_t) readLen;
        size_t pos = 0;
        while(pos < len && line[pos] != 0 && isSpaceOrTab(line[pos])) pos++; //eat leading whitespace

        if(pos < len){

            //check for comments
            if(line[pos] == '/' || line[pos] == '#')
            {
                //Comment - Skipping
            }
            else
            {
                const char* key = line + pos;
                while(pos < len && !isSpaceOrTab(line[pos]) && line[pos] != '=' && line[pos] != 0) pos++;
                line[pos] = 0;// null terminate the string (now contains the "key")

                pos++;

                //eat whitespace and = if needed
                while(pos < maxLineLength && line[pos] != 0 && (isSpaceOrTab(line[pos]) == true || line[pos] == '=') ) pos++; //skip spaces and =

                //debugPrintf("Key: %s", key);

                if(pos < len && line[pos] == '{')
                {
                    // { indicates the start of an array
                    //debugPrintf(" { ");
                    pos++; //skip the {

                    //Array of Values:
                    //TODO:: only Pin arrays are currently implemented
                    
                    //const size_t numConfigs = ARRAY_SIZE(boardConfigs);
                    for(size_t i=0; i<numConfigs; i++)
                    {
                        boardConfigEntry_t next = boardConfigEntryArray[i];
                        //Currently only handles Arrays of Pins
                        
                        
                        if(next.maxArrayEntries != nullptr /*&& next.type == cvPinType*/ && StringEqualsIgnoreCase(key, next.key))
                        {
                            //matched an entry in boardConfigEntryArray

                            //create a temp array to read into. Only copy the array entries into the final destination when we know the array is properly defined
                            const size_t maxArraySize = *next.maxArrayEntries;
                            
                            //Pin Array Type
                            Pin readArray[maxArraySize];

                            //eat whitespace
                            while(pos < maxLineLength && line[pos] != 0 && isSpaceOrTab(line[pos]) == true ) pos++;

                            bool searching = true;

                            size_t arrIdx = 0;

                            //search for values in Array
                            while( searching )
                            {
                                if(pos < maxLineLength)
                                {

                                    while(pos < maxLineLength && (isSpaceOrTab(line[pos]) == true)) pos++; // eat whitespace

                                    if(pos == maxLineLength)
                                    {
                                        debugPrintf("Got to end of line before end of array, line must be longer than maxLineLength");
                                        searching = false;
                                        break;
                                    }

                                    bool closedSuccessfully = false;
                                    //check brace isnt closed
                                    if(pos < maxLineLength && line[pos] == '}')
                                    {
                                        closedSuccessfully = true;
                                        arrIdx--; // we got the closing brace before getting a value this round, decrement arrIdx
                                    }
                                    else
                                    {

                                        if(arrIdx >= maxArraySize )
                                        {
                                            debugPrintf("Error : Too many entries defined in config for array\n");
                                            searching = false;
                                            break;
                                        }

                                        //Try to Read the next Value

                                        //should be at first char of value now
                                        char *valuePtr = line+pos;

                                        //read until end condition - space,comma,}  or null / # ;
                                        while(pos < maxLineLength && line[pos] != 0 && !isSpaceOrTab(line[pos]) && line[pos] != ',' && line[pos] != '}' && line[pos] != '/' && line[pos] != '#' && line[pos] != ';')
                                        {
                                            pos++;
                                        }
                                        // Skip trailing whitespace
                                        if (pos < maxLineLength && isSpaceOrTab(line[pos]))
                                        {
                                            // make sure we do not include trailing whitespace in string
                                            line[pos++] = 0; // null terminate the string
                                            while (pos < maxLineLength && isSpaceOrTab(line[pos]))
                                                pos++;
                                        }

                                        // make sure we ended on a valid character
                                        if(pos >= maxLineLength || (line[pos] != '}' && line[pos] != ','))
                                        {
                                            debugPrintf("Error: Array ended without Closing Brace?\n");
                                            searching = false;
                                            break;
                                        }

